# EastWest Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectPosition..::..EastWest Property
ProjectPosition Class See Also
---
East/West offset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double EastWest { get; set; }
```

Visual Basic
---
```text
Public Property EastWest As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double EastWest {
	double get ();
	void set (double value);
}
```

# Remarks
The offset of the project location from the site location in the east/west direction. Measured in decimal feet.
# See Also
ProjectPosition Class
Autodesk.Revit.DB Namespace